Repository: mikolaj-szubert/engineering-thesis
Catalog: MTM-Web-App.Server/Resources/Resource.*.resx
Languages: pl

source: Image added!
pl: Dodano zdjęcie!

source: User updated.
pl: Zaktualizowano użytkownika.

source: Error occurred. Please try again later.
pl: Wystąpił problem. Spróbuj ponownie później.

source: If the problem persists, please contact us.
pl: Jeśli problem się powtarza, proszę skontaktuj się z nami.

source: You do not have profile picture.
pl: Nie masz zdjęcia profilowego.

source: Your profie picture comes from Google link.
pl: Twoje zdjęcie profilowe pochodzi z linku Google.

source: You didn't provided any profile picture to add.
pl: Nie podałeś żadnego zdjęcia.

source: Invalid image extension. Accepted formats are ".png" and ".jpg".
pl: Nieporawidłowy format zdjęcia. Akceptowane formaty to ".png" oraz ".jpg".

source: Image deleted!
pl: Usunięto zdjęcie!

source: Reservation placed!
pl: Złożono rezerwację!

source: No reservations.
pl: Brak rezerwacji.

source: No restaurants.
pl: Brak restauracji.

source: No restaurant with given name.
pl: Brak restauracji o podanej nazwie.

source: No owned restaurants.
pl: Brak posiadanych restauracji.

source: No results for given address.
pl: Brak wyników dla podanego adresu.

source: Invalid request.
pl: Nieprawidłowe żądanie.

source: Current restaurant name cannot be empty.
pl: Bieżąca nazwa restauracji nie może być pusta.

source: Given name is already taken.
pl: Podana nazwa jest już zajęta.

source: You do not own restaurant with given name.
pl: Nie jesteś właścicielem restauracji o podanej nazwie.

source: Given currency is not yet supported.
pl: Podana waluta nie jest jeszcze wspierana.

source: Invalid opening time format.
pl: Nieprawidłowy format godziny otwarcia.

source: Invalid closing time format.
pl: Nieprawidłowy format godziny zamknięcia.

source: Restaurant deleted.
pl: Restauracja usunięta.

source: File does not exist.
pl: Plik nie istnieje.

source: No images added.
pl: Nie dodano zdjęć.

source: Missing restaurant name.
pl: Brak nazwy restauracji.

source: Given restaurant does not exist.
pl: Podana restauracja nie istnieje.

source: Invalid data.
pl: Nieprawidłowe dane.

source: Invalid reservation start time format.
pl: Nieprawidłowy format godziny rozpoczęcia rezerwacji.

source: Invalid reservation end time format.
pl: Nieprawidłowy format godziny zakończenia rezerwacji.

source: Invalid email.
pl: Nieprawidłowy email.

source: Login using Google and then set your password.
pl: Zaloguj się kontem Google i wtedy ustaw hasło.

source: Invalid credentials.
pl: Nieprawidłowe dane uwierzytelniające.

source: Error retrieving OAuth token.
pl: Błąd podczas pobierania tokenu OAuth.

source: Something went wrong. Try again later.
pl: Coś poszło nie tak. Spróbuj ponownie później.

source: Invalid email address.
pl: Nieprawidłowy adres email.

source: Email already exist. Try logging in.
pl: Podany email już istnieje w bazie danych. Spróbuj się zalogować.

# Logged out successfully.
source: Logged out!
pl: Wylogowano!

source: Your email has been already verified.
pl: Twój email został zweryfikowany!

source: Your One-Time Code is invalid
pl: Twój kod weryfikacyjny jest niepoprawny

# Your email address has been verified!
source: One-time code is valid!
pl: Podany kod jest poprawny!

source: One-Time Code has been sent.
pl: Email weryfikacyjny został wysłany.

source: Deleted!
pl: Usunięto!

source: Restaurant updated!
pl: Restauracja zaktualizowana!

source: Restaurant added!
pl: Restauracja dodana!

source: Images added!
pl: Dodano zdjęcia!

source: No hotels.
pl: Brak hoteli.

source: You do not own hotel with given name.
pl: Nie jesteś właścicielem hotelu o podanej nazwie.

source: Invalid check-in time format.
pl: Nieprawidłowy format godziny zameldowania.

source: Invalid check-out time format.
pl: Nieprawidłowy format godziny wymeldowania.

source: Hotel updated!
pl: Zaktualizowano hotel!

source: Hotel added!
pl: Dodano hotel!

source: Hotel deleted.
pl: Usunięto hotel.

source: Specified hotel does not exist.
pl: Podany hotel nie istnieje.

source: Specified room does not exist.
pl: Podany pokój nie istnieje.

source: Invalid file extension.
pl: Nieprawidłowe rozszerzenie pliku.

source: Missing name.
pl: Brak nazwy.

source: You do not have permission to do that.
pl: Nie masz do tego uprawnień.

source: Verify your email address first.
pl: Zweryfikuj swój adres email najpierw.

source: No logs.
pl: Brak logów.

source: Request was cancelled.
pl: Żądanie zostało anulowane.

source: Reservation
pl: Rezerwacja

source: Your reservation -
pl: Twoja rezerwacja -

source: Name
pl: Imię i nazwisko

source: Parameter
pl: Parametr

source: Value
pl: Wartość

source: Price
pl: Cena

source: Number of guests
pl: Liczba gości

source: Check out
pl: Wymeldowanie

source: Check in
pl: Zameldowanie

source: Reservation QR code:
pl: Kod QR do rezerwacji:

# HelloUser
source: Hello, {0}
pl: Cześć, {0}

# VerificationMessage
source: To complete your verification process, please use the following one-time code:
pl: Aby ukończyć proces weryfikacji, użyj następującego jednorazowego kodu:

# IgnoreEmail
source: If you didn't request this code, please ignore this email.
pl: Jeśli nie oczkiwałeś tego kodu, zignoruj ten e-mail.

# BestRegards
source: Best regards, MTM
pl: Z poważaniem, MTM

# FooterMessage
source: &copy; 2025 MTM. All rights reserved.
pl: &copy; 2025 MTM. Wszelkie prawa zastrzeżone.

# OTCEmailTitle
source: Your one-time code
pl: Twój jednorazowy kod weryfikacyjny

source: Reservation Details
pl: Szczegóły rezerwacji

source: This code is valid for the next 10 minutes. Please do not share it with anyone.
pl: Ten kod jest ważny przez 10 minut. Pod żadnym pozorem nie udostępniaj go nikomu.

source: Thank you for your reservation at
pl: Dziękujemy za Twoją rezerwację w

source: Your reservation details are as follows:
pl: Szczegóły rezerwacji są następujące:

source: If you have any questions or need to make changes to your reservation, please do not hesitate to contact us.
pl: W przypadku jakichkolwiek pytań lub konieczności wprowadzenia zmian w rezerwacji, prosimy o kontakt.

source: We look forward to welcoming you!
pl: Czekamy na Ciebie z niecierpliwością!

# Inavalid date.
source: Invalid date.
pl: Niepoprawna data.

source: Date
pl: Data

source: Incorrect facilities.
pl: Niepoprawne udogodnienia.

source: No hotels with specified filters.
pl: Brak hoteli o podanych filtrach.

source: Invalid open times
pl: Niepoprawne godziny otwarcia

source: Reservation number:
pl: Numer rezerwacji:

source: No restaurants with specified filters.
pl: Brak restauracji z podanymi filtrami.

source: Specified restaraurant does not exist.
pl: Podana restauracja nie istnieje.

source: Reservation Reminder
pl: Przypomnienie o rezerwacji

source: This is a friendly reminder about your upcoming reservation at
pl: Przypominamy o Twojej rezerwacji w

source: Here are the details of your reservation:
pl: Oto szczegóły Twojej rezerwacji:

source: If you have any questions or need to update your reservation, feel free to reach out to us.
pl: Jeśli masz pytania lub potrzebujesz wprowadzić zmiany w swojej rezerwacji, skontaktuj się z nami.

source: Safe travels, and we look forward to welcoming you tomorrow!
pl: Bezpiecznej podróży. Czekamy na Twoje przybycie jutro!

source: Given address is invalid.
pl: Podany adres jest nieprawidłowy.

source: This is a reminder about your reservation at
pl: Przypominamy o twojej rezerwacji w obiekcie

source: scheduled for tomorrow
pl: zaplanowanej na jutro
